const arrLang = {
    'ch': {
      'self-intro':"您好，我是葉宜姿，畢業於銘傳大學國際企業學系，<br>因好奇於搜尋引擎的運作機制，而興起轉職前端工程師的念頭。<br>而後自學報名加入泰山職訓開辦的網頁開發課程，其中學習了 HTML、CSS、JavaScript、jQuery 、Node.js、Vue、MongoDB以及網頁設計等技術與工具。 <br>雖然剛結束踏入前端領域的全職1000小時學習，但我了解沒有一步登天的事情，接下來的職涯，還是要靠自己不斷努力精進，不斷學習新事物，如此一來才有可能將想法演化成夢想，成為理想目標中的前端工程師。",

      'self-gakuriki':'銘傳大學-國際企業學系',

      'club-expe':'社團經驗：在大學期間選擇加入籃球系隊，籃球這項運動最大的重點就是團隊合作，而作為團隊的隊員，先要懂得配合才能成就一個團隊。<br />在練球的過程中，從不缺席的練習態度是我的堅持，漸漸的在球隊生活中養成了自我負責、做事認真的個性。',

      'self-orugano':'奧璐佳瑙科技股份有限公司-業務助理',

      'orugano-expe':'畢業後任職於日商奧璐佳瑙科技公司之業務助理一職，約莫兩年的在職經驗中，主要習得的實質經驗為：<br />(1)利用EXCEL工具進行資料內容的串整、資源與數據之統合、業績成效，並供予上層清楚參考<br />(2) 協助客戶對於商品價格、機能的查詢及報價相關的問題<br />(3) 協助公司內部接獲訂單前後的溝通',

      'sunndubu':'日本福岡-餐飲服務生',

      'sunndubu-expe':'為了增進自身的日文能力，在離開前職後，選擇直接至日本當地工作生活，相信在全日文的環境下一定能讓自己成長，不管是溝通或是獨自生活，都能讓每一天充滿挑戰，為自己寫下更多不同的故事。',

      'webdev-expe':' 在經歷約莫五個月的課程中習得的部分包括：<br>視覺設計軟體應用：Photoshop｜Illustrator<br>網頁前端技術：網頁切版、ＲＷＤ網站製作、Sass樣式管理、Bootstrap應用、串接後端API、JavaScript ＆JQuery小遊戲製作以及利用 Vue.js框架開發的個人畢業作品。<br>後端開發：Node.js+JavaScript <br>資料庫應用：MongoDB <br>也了解即使課程結束仍需持續學習，持續吸收變化快速的前端知識，期許有天真的能夠讓轉職理想成真，成為理想中的前端工程師！！',

      'work-exp':'希望能活用在職中習得的經驗為貴公司帶來價值與貢獻，<br>也期許自己能夠在新環境中精進網頁開發的製作、架構、與不可或缺的外語能力，<br>進而增進自身的價值，為貴公司帶來穩定的發展價值。<br><br>謝謝您撥空閱讀我的履歷，<br>我是葉宜姿，希望有機會至貴公司服務，謝謝您！'

    },
    'jp': {
      'self-intro':'はじめまして、<br />私、ヨウギシと申します、<br />大学で国際貿易で專攻しました。<br />\
      卒業後は水処理に関する会社で２年間営業アシスタントとして勤務しました <br />\ \
      その後、日本に生活してみたいので日本で飲食店でホールとして半年ぐらい仕事しました<br />\
      去年コロナの影響で帰国してWeb系の職種に変えたいので勉強を始めました<br />\
      千時間ぐらいの時間をかけて学校で卒業したばかりけど、\
      未だも経験不足だと思いますので自発的に勉強して前に進む事が非常に重要だと思います<br />\
      これまでの経験を活かして御社に貢献できるよう頑張ります、どうぞよろしくお願いします',

      'self-gakuriki':'銘伝大学-国際貿易学科',

      'club-expe':'大学時代の時にバスケットボール部に入って部活動を通してチームワークと努力を続けることの大切さを学びました。<br />\
      仕事も同じで、1人で全ての仕事をこなすということはあまりないです。<br />お互いに協力して自分の役割に責任感を持って取り組んでことが大事だと思います！',

      'self-orugano':'オルガノ株式会社 新竹支店-営業アシスタント',

      'orugano-expe':'大学卒業して営業アシスタントとして２年間勤務しました、その中の経験で学んだ事が主に以下の事になりました：<br />\
      (1)エクセルを利用して在庫と受注した資料を管理して見やすくように資料を整っています。<br />\
      (2)営業になれような能力も勉強して、客先から聞かれた質問に答えるように自発的に資料を探して、企画に聞いて対応できるように勉強し続けています、この事のお陰で一部的客先も私から対応し始めました。',

      'sunndubu':'東京純豆腐 天神IMS店/福岡大名店-飲食店ホール',
      
      'sunndubu-expe':'前職で勤務した際に日本語の能力に不足を深く感じまして、そして職場の同僚の日本人先輩たちにもよく仕事に対して責任感を持って積極的に取り組んでいる姿に感心していたので、\
      日本に生活して就職してみたい思いもどんどん心から出てきました。\
      仕事を辞めて２ヶ月後に日本に向かってワーキングホリデーにしました。<br />\
      その7ヶ月の中に学んできだ事が接客の日本語だけではなく、店長と同僚にも常に「おもてなし」の大切さを教えていただき、客の立場に考えてどんなサービスを提供したら客に喜ばせるになれるか？などの事をよく反省させたり改善させたりしました。<br />\
      時に言語の不足で客の要望をすぐ対応できないけど客様たちにも笑顔してくれて解決策を待ってくれていう事を今でもはっきり覚えています<br />\
      お互いに尊重して日本式のサービスと仕事態度が日本で生活していた時に大変勉強になれる経験でした。<br />',


      'webdev-expe':'コロナの影響で思ったより台湾に帰りました、転職活動をしていた際に政府から行ったWEB開発に関するスクールを見かけて、\
      知らない事を知るのが楽しいので、幼いからよく知らない事に好奇心を持ってWEBで検索して理解できる解釈が出るまでに粘り強く探していました。<br />\
      適切なキーワードを使って知りたい情報をWEBエンジで検索する事が面白いと思うからWEB系の職種に変えたい思いが強くなりました。<br />\
      そしてスクールに申し込んで半年ぐらいに勉強しました。<br />\
      その中に学んできた技術がJavaScript、jQuery、Node.js、Vue、MongoDB、などのweb開発に関する技術でした、卒業しても前に進む勉強する事が重要で、フロントエンドエンジニアになれるように頑張っています。',

      'work-exp':'お忙しい時間に履歴書を読んでいただき、ありがとうございます。<br />\
      これまでの経験を活かして御社に貢献できるよう頑張ります<br />\
      どうぞよろしくお願いします。'
    }
  };

  //  translation
  $(function() {
    $('.translate').click(function() {
      const lang = $(this).attr('id');
      $('.lang').each(function(index, item) {
        $(this).html(arrLang[lang][$(this).attr('key')])
      });
    });
  });