const arrLang = {
    'ch': {
      'self-intro':"您好，我是葉宜姿，畢業於銘傳大學國際企業學系。<br />因對於網頁搜尋引擎的好奇而選擇走上轉職之路，於今年二月畢業於泰山職訓局開辦的網頁前端培訓班。<br />雖然剛結束踏入前端領域的全職1000小時學習，但我了解沒有一步登天的事情，接下來的職涯，還是要靠自己不斷努力精進，不斷學習新事物，如此一來才有可能將想法演化成夢想，成為理想目標中的前端工程師。",

      'self-gakuriki':'銘傳大學-國際企業學系',

      'club-expe':'社團經驗：在大學期間選擇加入籃球系隊，籃球這項運動最大的重點就是團隊合作，而作為團隊的隊員，先要懂得配合才能成就一個團隊。<br />在練球的過程中，從不缺席的練習態度是我的堅持，漸漸的在球隊生活中養成了自我負責、做事認真的個性。',

      'self-orugano':'奧璐佳瑙科技股份有限公司-業務助理',

      'orugano-expe':'畢業後任職於日商奧璐佳瑙科技公司之業務助理一職，約莫兩年的在職經驗中，主要習得的實質經驗為：<br />(1)利用EXCEL工具進行資料內容的串整、資源與數據之統合、業績成效，並供予上層清楚參考<br />(2) 協助客戶對於商品價格、機能的查詢及報價相關的問題<br />(3) 協助公司內部接獲訂單前後的溝通',

      'sunndubu':'東京純豆腐 天神IMS店/福岡大名店-餐飲服務生',

      'sunndubu-expe':'於前職任職期間深感日文能力的不足無法為公司及自身創造更多的貢獻，且對於在職中日本同事之細膩負責的工作態度感到欽佩，於是前往了日本開始了約莫七個月的日本打工度假生活。<br />而在其中不僅僅習得了日語會話的能力，在接待日本客人時也在同事與店長的帶領、溝通下，學習了日本服務業的待客之道。<br />除了需主動站在客人的角度為之著想，也需時常思考對於提供何種的服務，能讓顧客感到愉悅及滿足。雖然時有犯錯、或是語言隔閡而無法進行溝通，但顧客仍以笑容相待，給予我機會請教同事解決的辦法。<br />我想在這趟旅途之中，收穫最豐盛的即是習得日式的服務態度、價值觀及與顧客相互尊重下得到的服務回饋。<br />在工作中以誠心相待，得到了相對的回饋後，會再督促、希望自己能不斷的改進、進步，對於自身來說，學習及成長，這或許就是工作中最大的喜悅。',

      'webdev-expe':' 因疫情關係提前結束了日本的工作而返台，在找工作的過程中，看到了職訓局開辦的網頁前端開發培訓班，但礙於非本科出身，從未考量過商管科外的職涯選擇，但從小對於好奇的事物即是開啟網頁的搜尋引擎開始尋找答案，而後便開始思索自身對於轉職網頁工程師的可能性。<br />在大量搜尋相似經驗的轉職心得後，覺得既然自己暫時不知何去何從，不如就努力將想法演化成夢想吧！<br />而也相信自身在學習的過程中會是滿足的，於是便很快地下定決心開始自學網頁知識，及準備報名相關事務。<br />在經歷約莫1000小時的課程中學習了 JavaScript、jQuery、Node.js、Vue、MongoDB、以及網頁設計等技術與工具，期許未來以前端工程師作為目標持續前進。',

      'work-exp':'希望能活用在職中習得的經驗為貴公司帶來價值與貢獻，<br>也期許自己能夠在新環境中精進網頁開發的製作、架構、與不可或缺的外語能力，<br>進而增進自身的價值，為貴公司帶來穩定的發展價值。<br><br>謝謝您撥空閱讀我的履歷，<br>我是葉宜姿，希望有機會至貴公司服務，謝謝您！'

    },
    'jp': {
      'self-intro':'はじめまして、<br />私、ヨウギシと申します、<br />大学で国際貿易で專攻しました。<br />\
      卒業後は水処理に関する会社で２年間営業アシスタントとして勤務しました <br />\ \
      そして日本に行って飲食店でホールとして半年ぐらい仕事しました<br />\
      去年にコロナの影響で帰国してWeb系の職種に変えたいので勉強を始めました<br />\
      千時間ぐらいの時間をかけて学校で卒業したばかりけど、\
      未だも経験不足だと思いつつ自分から勉強して積極的に前に進む事が非常に重要だと思います<br />\
      これまでの経験を活かして御社に貢献できるよう頑張ります、どうぞよろしくお願いします',

      'self-gakuriki':'銘伝大学-国際貿易学科',

      'club-expe':'私は大学時代の時にバスケットボール部に入って部活動を通してチームワークと努力を続けることの大切さを学びました。<br />\
      仕事も同じで、1人で全ての仕事をこなすということはあまりないです。<br />お互いに協力して自分の役割に責任感を持って取り組んでことが大事だと思います！',

      'self-orugano':'オルガノ株式会社 新竹支店-営業アシスタント',

      'orugano-expe':'大学卒業して営業アシスタントとして２年間勤務しました、その中の経験で学んだ事が主に以下の事になりました：<br />\
      (1)エクセルを利用して在庫と受注した資料を管理して見やすくように資料を整っています。<br />\
      (2)営業になれような能力も勉強して、客先から聞かれた質問に答えるように自ら資料を探して、企画に聞いて対応できるように勉強し続けています、この事のお陰で一部的客先も私から対応し始めました。',

      'sunndubu':'東京純豆腐 天神IMS店/福岡大名店-ホール',
      
      'sunndubu-expe':'前職で勤務した際に日本語の能力に不足を深く感じまして、そして職場の同僚の日本人先輩たちにもよく仕事に対して責任感を持って積極的に取り組んでいる姿に感心していたので、\
      日本に生活して就職してみたい思いもどんどん心から出てきました。\
      仕事を辞めて２月後に日本に向かってワーキングホリデーにしました。<br />\
      その7ヶ月の中に学んできだ事が接客の日本語だけではなく、店長と同僚にも常に「おもてなし」の大切さを教えていただき、客の立場に考えてどんなサービスを提供したら客に喜ばせるになれるか？などの事をよく反省させたり改善させたりしました。<br />\
      時に言語の不足で客の要望をすぐ対応できないけど客様たちにも笑顔してくれて解決策を待ってくれていう事を今でもはっきり覚えています<br />\
      お互いに尊重して日本式のサービスと仕事態度が日本で生活していた時に大変勉強になれる経験でした。<br />',


      'webdev-expe':'コロナの影響で思ったより台湾に帰りました、転職活動をしていた際に政府から行ったWEBに関するスクールを見かけて、\
      幼いからよく知らない事に好奇心を持ってWEBで検索して理解できる解釈が出るまでに粘り強く探していました。<br />\
      適切なキーワードを使って知りたい情報をWEBで検索する事が面白いと思うからWEB系に職種に変えたい思いが強くなりました。<br />\
      そしてスクールに申し込んで半年ぐらいに勉強しました。<br />\
      その中に学んできた技術がJavaScript、jQuery、Node.js、Vue、MongoDB、などのweb開発に関する技術でした、卒業しても勉強しつつフロントエンドエンジニアになれるように頑張っています。',

      'work-exp':'お忙しい時間に履歴書を読んでいただき、ありがとうございます。<br />\
      これまでの経験を活かして御社に貢献できるよう頑張ります<br />\
      どうぞよろしくお願いします。'
    }
  };

  //  translation
  $(function() {
    $('.translate').click(function() {
      const lang = $(this).attr('id');
      $('.lang').each(function(index, item) {
        $(this).html(arrLang[lang][$(this).attr('key')])
      });
    });
  });